//utils/imageMaps.ts
export const imageMaps: Record<string, any> = {
  // -------- บัว --------
  // "ลูกผักชีล้อม.jpg": require("@/assets/images/พิกัดบัวพิเศษ/พิกัดบัวพิเศษ/2.jpg"),
  // "ลูกผักชีลา.jpg": require("@/assets/images/พิกัดบัวพิเศษ/พิกัดบัวพิเศษ/ลูกผักชีลา.jpg"),
  // "ลูกเร่วใหญ่.jpg": require("@/assets/images/พิกัดบัวพิเศษ/พิกัดบัวพิเศษ/ลูกเร่วใหญ่.jpg"),
  // "ลูกเร่วน้อย.jpg": require("@/assets/images/พิกัดบัวพิเศษ/พิกัดบัวพิเศษ/ลูกเร่วน้อย.jpg"),
  // "ชะเอมเทศ.jpg": require("@/assets/images/พิกัดบัวพิเศษ/พิกัดบัวพิเศษ/ชะเอมเทศ.jpg"),
  // "ชะเอมไทย.jpg": require("@/assets/images/พิกัดบัวพิเศษ/พิกัดบัวพิเศษ/1.jpg"),
  // "ลำพัน.jpg": require("@/assets/images/พิกัดบัวพิเศษ/พิกัดบัวพิเศษ/ลำพันแดง.jpg"),
  // "อบเชยเทศ.jpg": require("@/assets/images/พิกัดบัวพิเศษ/พิกัดบัวพิเศษ/อบเชยเทศ.jpg"),
  // "อบเชยไทย.jpg": require("@/assets/images/พิกัดบัวพิเศษ/พิกัดบัวพิเศษ/อบเชยไทย.jpg"),

  // -------- โกดพิเศษ --------
  "โกฐกรักกรา.jpg": require("@/assets/images/พิกัดยาพิเศษ/พิกัดโกฐพิเศษ/โกฐกรักกรา.jpg"),
  "โกฐจันทน์.jpg": require("@/assets/images/พิกัดยาพิเศษ/พิกัดโกฐพิเศษ/โกฐจันทน์.jpg"),
  "โกฐน้ำเต้า.jpg": require("@/assets/images/พิกัดยาพิเศษ/พิกัดโกฐพิเศษ/โกฐน้ำเต้า.jpg"),

  // -------- พิกัดเทียนพิเศษ --------
  "เทียนลวด.jpg": require("@/assets/images/พิกัดยาพิเศษ/พิกัดเทียนพิเศษ/เทียนลวด.jpg"),
  "เทียนขม.jpg": require("@/assets/images/พิกัดยาพิเศษ/พิกัดเทียนพิเศษ/เทียนขม.jpg"),
  "เทียนแกลบ.jpg": require("@/assets/images/พิกัดยาพิเศษ/พิกัดเทียนพิเศษ/เทียนแกลบ.jpg"),
};
